# BuiltInFailures.MirrorFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MirrorFailures Class
BuiltInFailures Class Members See Also
---
Failures about Mirror.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class MirrorFailures
```

Visual Basic
---
```text
Public NotInheritable Class MirrorFailures
```

Visual C++
---
```text
public ref class MirrorFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..MirrorFailures
# See Also
BuiltInFailures..::..MirrorFailures Members
Autodesk.Revit.DB Namespace